<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
return [
        '1' => '推荐岗位通知-工程师',
        '2' => '投递简历通知-团队',
        '3' => '入职通知-团队',
        '4' => '入职通知-本人',
        '5' => '奖励满足条件-团队',
        '6' => '奖励满足条件-个人',
        '7' => '奖励满足条件-公司',
        '8' => '奖励到账通知-团队',
        '9' => '奖励到账通知-个人',
        '10' => '离职状态通知-团队',
        '11' => '活动报名通知--团队',
        '12' => '活动报名通知--个人',
        '13' => '活动取消通知-个人',
        '14' => '活动奖励到账通知--团队',
      /*  '14' => '平台推荐活动奖励',
        '15' => '代理商冻结活动推荐佣金',
        '16' => '代理商冻结职位推荐佣金',
        '17' => '代理商扣除冻结的活动推荐佣金',*/
];
