<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
return [
        '1' => '员工入职奖励',
        '2' => '会员推荐奖励',
        '3' => '会员提现',
        '4' => '平台推荐分红',
        '5' => '代理商推荐分红',
        '6' => '公司入职员工支付',
        '7' => '企业充值',
        '8' => '企业提现',
        '9' => '企业发薪',
        '10' => '员工得薪',
        '11' => '活动支付',
        '12' => '代理商活动入款',
        '13' => '会员推荐活动奖励',
        '14' => '平台推荐活动奖励',
        '15' => '代理商支付活动推荐佣金',
        '16' => '代理商冻结职位推荐佣金',
        '17' => '代理商扣除冻结的活动推荐佣金',
        '18' => '活动取消用户退款(从代理商冻结活动金额中扣取,代理商实际金额不变)',
        '19' => '用户预支工资(公司付款)',
        '20' => '用户预支工资(个人得款)',
];
