<?php
return [
    /*    足迹配置     */
    'footprint'=>[
        'type'=>1,
        'third_datename'=>'areas',
    ],

    'hr_agent_group'=>'4',
    /*    默认公司图标     */
    'default_company_icon'=>'/webinfo/config/default_compan_icon.png',

    /*    服务器域名     */
    'server_name'=>'headhunter.pinecc.cn',
    'education_name'=>[
        '0'=>'无',
        '1'=> '无',
        '2'=> '小学',
        '3'=> '初中',
        '4'=> '高中',
        '5'=> '大专',
        '6'=> '本科',
        '7'=> '硕士',
        '8'=> '博士',
        '9'=> '博士后',
        '10'=> '其他',
    ],
    'id_type'=>[
        '0'=>'系统',
       '1'=> '工程师',
       '2'=> 'hr',
       '3'=> '经纪人',
    ],
    'coin_log'=>[
        '1'=>[
            'method'=>1,
            'way'=>2,
            'discription'=>'下载简历',
        ],
        '2'=>[
            'method'=>2,
            'way'=>2,
            'discription'=>'参与投票',
        ],
        '3'=>[
            'method'=>3,
            'way'=>1,
            'discription'=>'投票成功分成',
        ],
        '4'=>[
            'method'=>4,
            'way'=>2,
            'discription'=>'面试通过hr消耗赏金',
        ],
        '5'=>[
            'method'=>5,
            'way'=>1,
            'discription'=>'面试通过agent获得赏金',
        ],
        '6'=>[
            'method'=>6,
            'way'=>1,
            'discription'=>'支付获得金币',
        ],
        '7'=>[
            'method'=>7,
            'way'=>1,
            'discription'=>'连续7天签到获得金币',
        ],
        '8'=>[
            'method'=>8,
            'way'=>1,
            'discription'=>'7天签到后分享到群或得30金币',
            'coin'=>30,
        ],
        '9'=>[
            'method'=>9,
            'way'=>1,
            'discription'=>'步数兑换金币',
            'coin'=>0,
        ],
    ],

    //金币类型
    'coin_type'=>[
        '1'=>[
            'name'=>'coin',
            'title'=>'金币'
        ],
        '2'=>[
            'name'=>'hr_coin',
            'title'=>'hr猎币'
        ],
        '3'=>[
            'name'=>'agent_coin',
            'title'=>'经纪人猎币'
        ],
    ],

    'cash_log'=>[
        '1'=>[
            'method'=>1,
            'way'=>2,
            'discription'=>'用户购买金币',
        ],
        '2'=>[
            'method'=>2,
            'way'=>2,
            'discription'=>'用户充值月度会员',
        ],
        '3'=>[
            'method'=>3,
            'way'=>2,
            'discription'=>'用户充值年度会员',
        ],
    ],
    'financing'=>[
        '1'=>'未融资',
        '2'=>'天使轮',
        '3'=>'A轮',
        '4'=>'B轮',
        '5'=>'C轮',
        '6'=>'D轮及以上',
        '7'=>'上市公司',
        '8'=>'不需要融资'
    ],
    'scale'=>[
        '1'=>'少于15人',
        '2'=>'15-50人',
        '3'=>'50-150人',
        '4'=>'150-500人',
        '5'=>'500-2000人',
        '6'=>'2000人以上',
    ],
    'job_experience'=>[
        '1'=>'应届毕业生',
        '2'=>'3年以内',
        '3'=>'3-5年',
        '4'=>'5-10年',
        '5'=>'10年以上',
    ],
    'nature'=>[
        '1'=>'短期兼职',
        '2'=>'长期兼职',
        '3'=>'不限',
    ],
    'will'=>[
        '1'=>'积极找工作',
        '2'=>'暂时不换工作',
        '3'=>'随便看看',
    ],
    'intime'=>[
        '1'=>'随时',
        '2'=>'两周以内',
        '3'=>'2周-一个月',
        '4'=>'1-3个月',
    ],

    'education'=>[
        '1'=>'无',
        '2'=>'小学',
        '3'=>'初中',
        '4'=>'高中',
        '5'=>'大专',
        '6'=>'本科',
        '7'=>'硕士',
        '8'=>'博士',
        '9'=>'博士后',
        '10'=>'其他',
    ],
    'education_show'=>[
        '1'=>'无',
        '4'=>'高中',
        '5'=>'大专',
        '6'=>'本科',
        '7'=>'硕士',
        '8'=>'博士',
        '10'=>'其他',
    ],

    'resume'=>[
        'salary_line'=>25000,//金边简历的月薪分界线
        'show_normal'=>40,
        'show_golden'=>40,
        'download_normal'=>100,
        'download_golden'=>200,
    ],

    'recruit_status' => [
        '1'=>'招聘中',
        '2'=>'暂停中',
        '3'=>'已结束',
        '4'=>'审核中',
        '5'=>'审核驳回',
    ],
    'withdraw_limit'=>30,
    'sign'=>[
        'day'=>7,
        'coin'=>100,
    ],
    'open_status'=>1,
    'member_charge'=>[
        '1'=>'180',
        '2'=>'20',
    ],
    'salary_range'=>[
        '1'=>'不限',
        '2'=>'0-2K',
        '3'=>'2K-5K',
        '4'=>'5K-10K',
        '5'=>'10K-15K',
        '6'=>'15K-25K',
        '7'=>'25K-50K',
        '8'=>'大于50K',
    ],





];